# ----------------------------------------------------
# aからｚのアルファベットを一つずつリストに格納する（計26文字）
# ----------------------------------------------------
a = []
for i in range(97, 123):
    a.append(chr(i))
print(a)
# ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
a = [chr(i) for i in range(97, 123)]

# ----------------------------------------------------
# アルファベットを1文字ずつ比較して何文字ずれているか計算するメソッド（計26文字）
# ----------------------------------------------------
s = list(input())
t = list(input())
# 26文字のアルファベットのユニコードを出す
temp = (ord(s[0]) - ord(t[0])) % 26

def alphabet(s, t):
    for i in range(len(s)):
        if (ord(s[i]) - ord(t[i])) % 26 == temp:
            continue
        else:
            return "No"
    return "Yes"

print(alphabet(s, t))
