#ABC246_B
# ----------------------------------------------------
# 三平方の定理使用して座標問題を解く
# 2点間の距離の求め方は a**2+b**2=c**2 から計算する
# ----------------------------------------------------
import math
a, b = map(int, input().split())
d = math.sqrt(a**2+b**2)

print(a/d, b/d)

# ABC174_B
# ----------------------------------------------------
# 三平方の定理使用して座標問題を解く
# 2点間の距離の求め方は a**2+b**2=c**2 から計算する
# ----------------------------------------------------
import math
n, d = map(int, input().split())
count = 0

for i in range(n):
    x, y = map(int, input().split())
    if math.sqrt(x**2+y**2) <= d:
        count +=1
print(count)